import type { StudyMovieType } from "@/app/type/StudyMovieType";

export const studyMovieArray: StudyMovieType[] = [
	{
		title: "バージョンと宣言",
		text: "初めてでも大丈夫",
		videoId: "KkXRYCwlbIE",
		about:
			"HTMLはウェブの進化とともに複数回バージョンアップが行われ、現在ではHTML5が主流となっています。最初のHTML 1.0は1993年に登場し、テキスト表示やリンクなど基本的な機能だけを備えたシンプルな仕様でした。その後、1995年にHTML 2.0でフォーム要素が追加され、1997年にはHTML 3.2でスタイルシート（CSS）のサポートやテーブル、スクリプト機能の強化が行われました。さらに1999年にはHTML 4.01が登場し、現代的なウェブの基盤が築かれました。このバージョンでは、アクセシビリティや国際化が強化され、Strict、Transitional、Framesetという3つのモードが導入されました。そして2014年、HTML5が正式にリリースされ、モバイル対応が強化されるとともに、ビデオやオーディオ、キャンバスAPIなどがネイティブでサポートされるようになりました。また、HTML5ではセマンティック要素（<article>や<nav>など）が追加され、より意味のある構造化が可能になっています。HTML文書の冒頭に記述されるDOCTYPE宣言は、ブラウザにそのHTML文書のバージョンを伝える役割を持ちます。また、ブラウザが標準モードでレンダリングするか、互換モードでレンダリングするかを決定するための指標となります。HTML5以前のDOCTYPE宣言は、HTMLのバージョンによって非常に長く複雑な記述が必要でしたが、HTML5では以下のように簡潔化されました。",
	},
	{
		title: "JS 入門1",
		text: "初めてでも大丈夫",
		videoId: "QCjFPSO96RU",
		about:
			"HTMLはウェブの進化とともに複数回バージョンアップが行われ、現在ではHTML5が主流となっています。最初のHTML 1.0は1993年に登場し、テキスト表示やリンクなど基本的な機能だけを備えたシンプルな仕様でした。その後、1995年にHTML 2.0でフォーム要素が追加され、1997年にはHTML 3.2でスタイルシート（CSS）のサポートやテーブル、スクリプト機能の強化が行われました。さらに1999年にはHTML 4.01が登場し、現代的なウェブの基盤が築かれました。このバージョンでは、アクセシビリティや国際化が強化され、Strict、Transitional、Framesetという3つのモードが導入されました。そして2014年、HTML5が正式にリリースされ、モバイル対応が強化されるとともに、ビデオやオーディオ、キャンバスAPIなどがネイティブでサポートされるようになりました。また、HTML5ではセマンティック要素（<article>や<nav>など）が追加され、より意味のある構造化が可能になっています。HTML文書の冒頭に記述されるDOCTYPE宣言は、ブラウザにそのHTML文書のバージョンを伝える役割を持ちます。また、ブラウザが標準モードでレンダリングするか、互換モードでレンダリングするかを決定するための指標となります。HTML5以前のDOCTYPE宣言は、HTMLのバージョンによって非常に長く複雑な記述が必要でしたが、HTML5では以下のように簡潔化されました。",
	},
	{
		title: "React",
		text: "Reactの入門",
		about:
			"HTMLはウェブの進化とともに複数回バージョンアップが行われ、現在ではHTML5が主流となっています。最初のHTML 1.0は1993年に登場し、テキスト表示やリンクなど基本的な機能だけを備えたシンプルな仕様でした。その後、1995年にHTML 2.0でフォーム要素が追加され、1997年にはHTML 3.2でスタイルシート（CSS）のサポートやテーブル、スクリプト機能の強化が行われました。さらに1999年にはHTML 4.01が登場し、現代的なウェブの基盤が築かれました。このバージョンでは、アクセシビリティや国際化が強化され、Strict、Transitional、Framesetという3つのモードが導入されました。そして2014年、HTML5が正式にリリースされ、モバイル対応が強化されるとともに、ビデオやオーディオ、キャンバスAPIなどがネイティブでサポートされるようになりました。また、HTML5ではセマンティック要素（<article>や<nav>など）が追加され、より意味のある構造化が可能になっています。HTML文書の冒頭に記述されるDOCTYPE宣言は、ブラウザにそのHTML文書のバージョンを伝える役割を持ちます。また、ブラウザが標準モードでレンダリングするか、互換モードでレンダリングするかを決定するための指標となります。HTML5以前のDOCTYPE宣言は、HTMLのバージョンによって非常に長く複雑な記述が必要でしたが、HTML5では以下のように簡潔化されました。",
		videoId: "nRCNL9T3J98",
	},
	{
		title: "CSS",
		text: "アニメーション",
		about:
			"HTMLはウェブの進化とともに複数回バージョンアップが行われ、現在ではHTML5が主流となっています。最初のHTML 1.0は1993年に登場し、テキスト表示やリンクなど基本的な機能だけを備えたシンプルな仕様でした。その後、1995年にHTML 2.0でフォーム要素が追加され、1997年にはHTML 3.2でスタイルシート（CSS）のサポートやテーブル、スクリプト機能の強化が行われました。さらに1999年にはHTML 4.01が登場し、現代的なウェブの基盤が築かれました。このバージョンでは、アクセシビリティや国際化が強化され、Strict、Transitional、Framesetという3つのモードが導入されました。そして2014年、HTML5が正式にリリースされ、モバイル対応が強化されるとともに、ビデオやオーディオ、キャンバスAPIなどがネイティブでサポートされるようになりました。また、HTML5ではセマンティック要素（<article>や<nav>など）が追加され、より意味のある構造化が可能になっています。HTML文書の冒頭に記述されるDOCTYPE宣言は、ブラウザにそのHTML文書のバージョンを伝える役割を持ちます。また、ブラウザが標準モードでレンダリングするか、互換モードでレンダリングするかを決定するための指標となります。HTML5以前のDOCTYPE宣言は、HTMLのバージョンによって非常に長く複雑な記述が必要でしたが、HTML5では以下のように簡潔化されました。",
		videoId: "AcG9T2BRA6E",
	},
	{
		title: "HTML 入門1",
		text: "初めてでも大丈夫",
		about:
			"HTMLはウェブの進化とともに複数回バージョンアップが行われ、現在ではHTML5が主流となっています。最初のHTML 1.0は1993年に登場し、テキスト表示やリンクなど基本的な機能だけを備えたシンプルな仕様でした。その後、1995年にHTML 2.0でフォーム要素が追加され、1997年にはHTML 3.2でスタイルシート（CSS）のサポートやテーブル、スクリプト機能の強化が行われました。さらに1999年にはHTML 4.01が登場し、現代的なウェブの基盤が築かれました。このバージョンでは、アクセシビリティや国際化が強化され、Strict、Transitional、Framesetという3つのモードが導入されました。そして2014年、HTML5が正式にリリースされ、モバイル対応が強化されるとともに、ビデオやオーディオ、キャンバスAPIなどがネイティブでサポートされるようになりました。また、HTML5ではセマンティック要素（<article>や<nav>など）が追加され、より意味のある構造化が可能になっています。HTML文書の冒頭に記述されるDOCTYPE宣言は、ブラウザにそのHTML文書のバージョンを伝える役割を持ちます。また、ブラウザが標準モードでレンダリングするか、互換モードでレンダリングするかを決定するための指標となります。HTML5以前のDOCTYPE宣言は、HTMLのバージョンによって非常に長く複雑な記述が必要でしたが、HTML5では以下のように簡潔化されました。",
		videoId: "eEP7CLqnRr0",
	},
	{
		title: "HTML 入門1",
		text: "初めてでも大丈夫",
		about:
			"HTMLはウェブの進化とともに複数回バージョンアップが行われ、現在ではHTML5が主流となっています。最初のHTML 1.0は1993年に登場し、テキスト表示やリンクなど基本的な機能だけを備えたシンプルな仕様でした。その後、1995年にHTML 2.0でフォーム要素が追加され、1997年にはHTML 3.2でスタイルシート（CSS）のサポートやテーブル、スクリプト機能の強化が行われました。さらに1999年にはHTML 4.01が登場し、現代的なウェブの基盤が築かれました。このバージョンでは、アクセシビリティや国際化が強化され、Strict、Transitional、Framesetという3つのモードが導入されました。そして2014年、HTML5が正式にリリースされ、モバイル対応が強化されるとともに、ビデオやオーディオ、キャンバスAPIなどがネイティブでサポートされるようになりました。また、HTML5ではセマンティック要素（<article>や<nav>など）が追加され、より意味のある構造化が可能になっています。HTML文書の冒頭に記述されるDOCTYPE宣言は、ブラウザにそのHTML文書のバージョンを伝える役割を持ちます。また、ブラウザが標準モードでレンダリングするか、互換モードでレンダリングするかを決定するための指標となります。HTML5以前のDOCTYPE宣言は、HTMLのバージョンによって非常に長く複雑な記述が必要でしたが、HTML5では以下のように簡潔化されました。",
		videoId: "KkXRYCwlbIE",
	},
	{
		title: "HTML 入門1",
		text: "初めてでも大丈夫",
		about:
			"HTMLはウェブの進化とともに複数回バージョンアップが行われ、現在ではHTML5が主流となっています。最初のHTML 1.0は1993年に登場し、テキスト表示やリンクなど基本的な機能だけを備えたシンプルな仕様でした。その後、1995年にHTML 2.0でフォーム要素が追加され、1997年にはHTML 3.2でスタイルシート（CSS）のサポートやテーブル、スクリプト機能の強化が行われました。さらに1999年にはHTML 4.01が登場し、現代的なウェブの基盤が築かれました。このバージョンでは、アクセシビリティや国際化が強化され、Strict、Transitional、Framesetという3つのモードが導入されました。そして2014年、HTML5が正式にリリースされ、モバイル対応が強化されるとともに、ビデオやオーディオ、キャンバスAPIなどがネイティブでサポートされるようになりました。また、HTML5ではセマンティック要素（<article>や<nav>など）が追加され、より意味のある構造化が可能になっています。HTML文書の冒頭に記述されるDOCTYPE宣言は、ブラウザにそのHTML文書のバージョンを伝える役割を持ちます。また、ブラウザが標準モードでレンダリングするか、互換モードでレンダリングするかを決定するための指標となります。HTML5以前のDOCTYPE宣言は、HTMLのバージョンによって非常に長く複雑な記述が必要でしたが、HTML5では以下のように簡潔化されました。",
		videoId: "KkXRYCwlbIE",
	},
	{
		title: "HTML 入門1",
		text: "初めてでも大丈夫",
		about:
			"HTMLはウェブの進化とともに複数回バージョンアップが行われ、現在ではHTML5が主流となっています。最初のHTML 1.0は1993年に登場し、テキスト表示やリンクなど基本的な機能だけを備えたシンプルな仕様でした。その後、1995年にHTML 2.0でフォーム要素が追加され、1997年にはHTML 3.2でスタイルシート（CSS）のサポートやテーブル、スクリプト機能の強化が行われました。さらに1999年にはHTML 4.01が登場し、現代的なウェブの基盤が築かれました。このバージョンでは、アクセシビリティや国際化が強化され、Strict、Transitional、Framesetという3つのモードが導入されました。そして2014年、HTML5が正式にリリースされ、モバイル対応が強化されるとともに、ビデオやオーディオ、キャンバスAPIなどがネイティブでサポートされるようになりました。また、HTML5ではセマンティック要素（<article>や<nav>など）が追加され、より意味のある構造化が可能になっています。HTML文書の冒頭に記述されるDOCTYPE宣言は、ブラウザにそのHTML文書のバージョンを伝える役割を持ちます。また、ブラウザが標準モードでレンダリングするか、互換モードでレンダリングするかを決定するための指標となります。HTML5以前のDOCTYPE宣言は、HTMLのバージョンによって非常に長く複雑な記述が必要でしたが、HTML5では以下のように簡潔化されました。",
		videoId: "QCjFPSO96RU",
	},
	{
		title: "HTML 入門1",
		text: "初めてでも大丈夫",
		about:
			"HTMLはウェブの進化とともに複数回バージョンアップが行われ、現在ではHTML5が主流となっています。最初のHTML 1.0は1993年に登場し、テキスト表示やリンクなど基本的な機能だけを備えたシンプルな仕様でした。その後、1995年にHTML 2.0でフォーム要素が追加され、1997年にはHTML 3.2でスタイルシート（CSS）のサポートやテーブル、スクリプト機能の強化が行われました。さらに1999年にはHTML 4.01が登場し、現代的なウェブの基盤が築かれました。このバージョンでは、アクセシビリティや国際化が強化され、Strict、Transitional、Framesetという3つのモードが導入されました。そして2014年、HTML5が正式にリリースされ、モバイル対応が強化されるとともに、ビデオやオーディオ、キャンバスAPIなどがネイティブでサポートされるようになりました。また、HTML5ではセマンティック要素（<article>や<nav>など）が追加され、より意味のある構造化が可能になっています。HTML文書の冒頭に記述されるDOCTYPE宣言は、ブラウザにそのHTML文書のバージョンを伝える役割を持ちます。また、ブラウザが標準モードでレンダリングするか、互換モードでレンダリングするかを決定するための指標となります。HTML5以前のDOCTYPE宣言は、HTMLのバージョンによって非常に長く複雑な記述が必要でしたが、HTML5では以下のように簡潔化されました。",
		videoId: "KkXRYCwlbIE",
	},
	{
		title: "HTML 入門1",
		text: "初めてでも大丈夫",
		about:
			"HTMLはウェブの進化とともに複数回バージョンアップが行われ、現在ではHTML5が主流となっています。最初のHTML 1.0は1993年に登場し、テキスト表示やリンクなど基本的な機能だけを備えたシンプルな仕様でした。その後、1995年にHTML 2.0でフォーム要素が追加され、1997年にはHTML 3.2でスタイルシート（CSS）のサポートやテーブル、スクリプト機能の強化が行われました。さらに1999年にはHTML 4.01が登場し、現代的なウェブの基盤が築かれました。このバージョンでは、アクセシビリティや国際化が強化され、Strict、Transitional、Framesetという3つのモードが導入されました。そして2014年、HTML5が正式にリリースされ、モバイル対応が強化されるとともに、ビデオやオーディオ、キャンバスAPIなどがネイティブでサポートされるようになりました。また、HTML5ではセマンティック要素（<article>や<nav>など）が追加され、より意味のある構造化が可能になっています。HTML文書の冒頭に記述されるDOCTYPE宣言は、ブラウザにそのHTML文書のバージョンを伝える役割を持ちます。また、ブラウザが標準モードでレンダリングするか、互換モードでレンダリングするかを決定するための指標となります。HTML5以前のDOCTYPE宣言は、HTMLのバージョンによって非常に長く複雑な記述が必要でしたが、HTML5では以下のように簡潔化されました。",
		videoId: "KkXRYCwlbIE",
	},
	{
		title: "HTML 入門1",
		text: "初めてでも大丈夫",
		about:
			"HTMLはウェブの進化とともに複数回バージョンアップが行われ、現在ではHTML5が主流となっています。最初のHTML 1.0は1993年に登場し、テキスト表示やリンクなど基本的な機能だけを備えたシンプルな仕様でした。その後、1995年にHTML 2.0でフォーム要素が追加され、1997年にはHTML 3.2でスタイルシート（CSS）のサポートやテーブル、スクリプト機能の強化が行われました。さらに1999年にはHTML 4.01が登場し、現代的なウェブの基盤が築かれました。このバージョンでは、アクセシビリティや国際化が強化され、Strict、Transitional、Framesetという3つのモードが導入されました。そして2014年、HTML5が正式にリリースされ、モバイル対応が強化されるとともに、ビデオやオーディオ、キャンバスAPIなどがネイティブでサポートされるようになりました。また、HTML5ではセマンティック要素（<article>や<nav>など）が追加され、より意味のある構造化が可能になっています。HTML文書の冒頭に記述されるDOCTYPE宣言は、ブラウザにそのHTML文書のバージョンを伝える役割を持ちます。また、ブラウザが標準モードでレンダリングするか、互換モードでレンダリングするかを決定するための指標となります。HTML5以前のDOCTYPE宣言は、HTMLのバージョンによって非常に長く複雑な記述が必要でしたが、HTML5では以下のように簡潔化されました。",
		videoId: "QCjFPSO96RU",
	},
	{
		title: "HTML 入門1",
		text: "初めてでも大丈夫",
		about:
			"HTMLはウェブの進化とともに複数回バージョンアップが行われ、現在ではHTML5が主流となっています。最初のHTML 1.0は1993年に登場し、テキスト表示やリンクなど基本的な機能だけを備えたシンプルな仕様でした。その後、1995年にHTML 2.0でフォーム要素が追加され、1997年にはHTML 3.2でスタイルシート（CSS）のサポートやテーブル、スクリプト機能の強化が行われました。さらに1999年にはHTML 4.01が登場し、現代的なウェブの基盤が築かれました。このバージョンでは、アクセシビリティや国際化が強化され、Strict、Transitional、Framesetという3つのモードが導入されました。そして2014年、HTML5が正式にリリースされ、モバイル対応が強化されるとともに、ビデオやオーディオ、キャンバスAPIなどがネイティブでサポートされるようになりました。また、HTML5ではセマンティック要素（<article>や<nav>など）が追加され、より意味のある構造化が可能になっています。HTML文書の冒頭に記述されるDOCTYPE宣言は、ブラウザにそのHTML文書のバージョンを伝える役割を持ちます。また、ブラウザが標準モードでレンダリングするか、互換モードでレンダリングするかを決定するための指標となります。HTML5以前のDOCTYPE宣言は、HTMLのバージョンによって非常に長く複雑な記述が必要でしたが、HTML5では以下のように簡潔化されました。",
		videoId: "KkXRYCwlbIE",
	},
];
